import base_person

man = base_person.Person("Алекс", 30, 180)
man.description_person()

warrior = base_person.Warrior("Конан", 33, 200)
print("Нового воина зовут " + warrior.description_person())

# Персонаж (Родительский класс)
#
# подкласс: Раса (люди, эльфы, гномы, орки)
# подкласс: Специальность (воин, маг, лучник)
#
# Родительский класс                              Персонаж
#
# Подкласс                                Раса                        Специальность
#
# Подкласс подкласса                люди   эльфы   гномы   орки       воин    маг    лучник